cmsis-svd/cmsis-svd/data/TexasInstruments/TM4C123GH6ZRB.svd
        <register>
          <name>_3_GENB</name>
          <description>PWM3 Generator B Control</description>
          <addressOffset>0x00000124</addressOffset>
          <fields>
            <field>
              <name>PWM_3_GENB_ACTZERO</name>
              <description>Action for Counter=0</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTZERO_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTZERO_INV</name>
                  <description>Invert the output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTZERO_ZERO</name>
                  <description>Set the output signal to 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTZERO_ONE</name>
                  <description>Set the output signal to 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_3_GENB_ACTLOAD</name>
              <description>Action for Counter=Load</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTLOAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTLOAD_INV</name>
                  <description>Invert the output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTLOAD_ZERO</name>
                  <description>Set the output signal to 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTLOAD_ONE</name>
                  <description>Set the output signal to 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_3_GENB_ACTCMPAU</name>
              <description>Action for Comparator A Up</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTCMPAU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTCMPAU_INV</name>
                  <description>Invert the output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTCMPAU_ZERO</name>
                  <description>Set the output signal to 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTCMPAU_ONE</name>
                  <description>Set the output signal to 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_3_GENB_ACTCMPAD</name>
              <description>Action for Comparator A Down</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTCMPAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTCMPAD_INV</name>
                  <description>Invert the output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTCMPAD_ZERO</name>
                  <description>Set the output signal to 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTCMPAD_ONE</name>
                  <description>Set the output signal to 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_3_GENB_ACTCMPBU</name>
              <description>Action for Comparator B Up</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTCMPBU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTCMPBU_INV</name>
                  <description>Invert the output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTCMPBU_ZERO</name>
                  <description>Set the output signal to 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTCMPBU_ONE</name>
                  <description>Set the output signal to 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_3_GENB_ACTCMPBD</name>
              <description>Action for Comparator B Down</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTCMPBD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTCMPBD_INV</name>
                  <description>Invert the output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTCMPBD_ZERO</name>
                  <description>Set the output signal to 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_GENB_ACTCMPBD_ONE</name>
                  <description>Set the output signal to 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_DBCTL</name>
          <description>PWM3 Dead-Band Control</description>
          <addressOffset>0x00000128</addressOffset>
          <fields>
            <field>
              <name>PWM_3_DBCTL_ENABLE</name>
              <description>Dead-Band Generator Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_DBRISE</name>
          <description>PWM3 Dead-Band Rising-Edge Delay</description>
          <addressOffset>0x0000012C</addressOffset>
          <fields>
            <field>
              <name>PWM_3_DBRISE_RISEDELAY</name>
              <description>Dead-Band Rise Delay</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_DBFALL</name>
          <description>PWM3 Dead-Band Falling-Edge-Delay</description>
          <addressOffset>0x00000130</addressOffset>
          <fields>
            <field>
              <name>PWM_3_DBFALL_FALLDELAY</name>
              <description>Dead-Band Fall Delay</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_FLTSRC0</name>
          <description>PWM3 Fault Source 0</description>
          <addressOffset>0x00000134</addressOffset>
          <fields>
            <field>
              <name>PWM_3_FLTSRC0_FAULT0</name>
              <description>Fault0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_3_FLTSRC0_FAULT1</name>
              <description>Fault1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_3_FLTSRC0_FAULT2</name>
              <description>Fault2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_3_FLTSRC0_FAULT3</name>
              <description>Fault3 Input</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_FLTSRC1</name>
          <description>PWM3 Fault Source 1</description>
          <addressOffset>0x00000138</addressOffset>
          <fields>
            <field>
              <name>PWM_3_FLTSRC1_DCMP0</name>
              <description>Digital Comparator 0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_3_FLTSRC1_DCMP1</name>
              <description>Digital Comparator 1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_3_FLTSRC1_DCMP2</name>
              <description>Digital Comparator 2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_3_FLTSRC1_DCMP3</name>
              <description>Digital Comparator 3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_3_FLTSRC1_DCMP4</name>
              <description>Digital Comparator 4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_3_FLTSRC1_DCMP5</name>
              <description>Digital Comparator 5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PWM_3_FLTSRC1_DCMP6</name>
              <description>Digital Comparator 6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PWM_3_FLTSRC1_DCMP7</name>
              <description>Digital Comparator 7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_MINFLTPER</name>
          <description>PWM3 Minimum Fault Period</description>
          <addressOffset>0x0000013C</addressOffset>
          <fields>
            <field>
              <name>PWM_3_MINFLTPER_MFP</name>
              <description>Minimum Fault Period</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_FLTSEN</name>
          <description>PWM0 Fault Pin Logic Sense</description>
          <addressOffset>0x00000800</addressOffset>
          <fields>
            <field>
              <name>PWM_0_FLTSEN_FAULT0</name>
              <description>Fault0 Sense</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_0_FLTSEN_FAULT1</name>
              <description>Fault1 Sense</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_0_FLTSEN_FAULT2</name>
              <description>Fault2 Sense</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_0_FLTSEN_FAULT3</name>
              <description>Fault3 Sense</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_FLTSTAT0</name>
          <description>PWM0 Fault Status 0</description>
          <addressOffset>0x00000804</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PWM_0_FLTSTAT0_FAULT0</name>
              <description>Fault Input 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_0_FLTSTAT0_FAULT1</name>
              <description>Fault Input 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_0_FLTSTAT0_FAULT2</name>
              <description>Fault Input 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_0_FLTSTAT0_FAULT3</name>
              <description>Fault Input 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_FLTSTAT1</name>
          <description>PWM0 Fault Status 1</description>
          <addressOffset>0x00000808</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PWM_0_FLTSTAT1_DCMP0</name>
              <description>Digital Comparator 0 Trigger</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_0_FLTSTAT1_DCMP1</name>
              <description>Digital Comparator 1 Trigger</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_0_FLTSTAT1_DCMP2</name>
              <description>Digital Comparator 2 Trigger</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_0_FLTSTAT1_DCMP3</name>
              <description>Digital Comparator 3 Trigger</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_0_FLTSTAT1_DCMP4</name>
              <description>Digital Comparator 4 Trigger</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_0_FLTSTAT1_DCMP5</name>
              <description>Digital Comparator 5 Trigger</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_0_FLTSTAT1_DCMP6</name>
              <description>Digital Comparator 6 Trigger</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_0_FLTSTAT1_DCMP7</name>
              <description>Digital Comparator 7 Trigger</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_1_FLTSEN</name>
          <description>PWM1 Fault Pin Logic Sense</description>
          <addressOffset>0x00000880</addressOffset>
          <fields>
            <field>
              <name>PWM_1_FLTSEN_FAULT0</name>
              <description>Fault0 Sense</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_1_FLTSEN_FAULT1</name>
              <description>Fault1 Sense</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_1_FLTSEN_FAULT2</name>
              <description>Fault2 Sense</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_1_FLTSEN_FAULT3</name>
              <description>Fault3 Sense</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_1_FLTSTAT0</name>
          <description>PWM1 Fault Status 0</description>
          <addressOffset>0x00000884</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PWM_1_FLTSTAT0_FAULT0</name>
              <description>Fault Input 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_1_FLTSTAT0_FAULT1</name>
              <description>Fault Input 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_1_FLTSTAT0_FAULT2</name>
              <description>Fault Input 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_1_FLTSTAT0_FAULT3</name>
              <description>Fault Input 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_1_FLTSTAT1</name>
          <description>PWM1 Fault Status 1</description>
          <addressOffset>0x00000888</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PWM_1_FLTSTAT1_DCMP0</name>
              <description>Digital Comparator 0 Trigger</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_1_FLTSTAT1_DCMP1</name>
              <description>Digital Comparator 1 Trigger</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_1_FLTSTAT1_DCMP2</name>
              <description>Digital Comparator 2 Trigger</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_1_FLTSTAT1_DCMP3</name>
              <description>Digital Comparator 3 Trigger</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_1_FLTSTAT1_DCMP4</name>
              <description>Digital Comparator 4 Trigger</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_1_FLTSTAT1_DCMP5</name>
              <description>Digital Comparator 5 Trigger</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_1_FLTSTAT1_DCMP6</name>
              <description>Digital Comparator 6 Trigger</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_1_FLTSTAT1_DCMP7</name>
              <description>Digital Comparator 7 Trigger</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_2_FLTSEN</name>
          <description>PWM2 Fault Pin Logic Sense</description>
          <addressOffset>0x00000900</addressOffset>
          <fields>
            <field>
              <name>PWM_2_FLTSEN_FAULT0</name>
              <description>Fault0 Sense</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_2_FLTSEN_FAULT1</name>
              <description>Fault1 Sense</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_2_FLTSEN_FAULT2</name>
              <description>Fault2 Sense</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_2_FLTSEN_FAULT3</name>
              <description>Fault3 Sense</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_2_FLTSTAT0</name>
          <description>PWM2 Fault Status 0</description>
          <addressOffset>0x00000904</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PWM_2_FLTSTAT0_FAULT0</name>
              <description>Fault Input 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_2_FLTSTAT0_FAULT1</name>
              <description>Fault Input 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_2_FLTSTAT0_FAULT2</name>
              <description>Fault Input 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_2_FLTSTAT0_FAULT3</name>
              <description>Fault Input 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
