cmsis-svd/cmsis-svd/data/TexasInstruments/TM4C123GH6ZRB.svd
        <register>
          <name>TXCSRH7</name>
          <description>USB Transmit Control and Status Endpoint 7 High</description>
          <addressOffset>0x00000173</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRH7_DT</name>
              <description>Data Toggle</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH7_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH7_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH7_FDT</name>
              <description>Force Data Toggle</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH7_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH7_MODE</name>
              <description>Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH7_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH7_AUTOSET</name>
              <description>Auto Set</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMAXP7</name>
          <description>USB Maximum Receive Data Endpoint 7</description>
          <addressOffset>0x00000174</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXMAXP7_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL7</name>
          <description>USB Receive Control and Status Endpoint 7 Low</description>
          <addressOffset>0x00000176</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL7_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL7_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL7_OVER</name>
              <description>Overrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL7_DATAERR</name>
              <description>Data Error</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL7_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL7_STALL</name>
              <description>Send STALL</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL7_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL7_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL7</name>
          <description>USB Receive Control and Status Endpoint 7 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000176</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL7_ERROR</name>
              <description>Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL7_NAKTO</name>
              <description>NAK Timeout</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL7_REQPKT</name>
              <description>Request Packet</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH7</name>
          <description>USB Receive Control and Status Endpoint 7 High</description>
          <addressOffset>0x00000177</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH7_DT</name>
              <description>Data Toggle</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH7_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH7_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH7_PIDERR</name>
              <description>PID Error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH7_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH7_AUTORQ</name>
              <description>Auto Request</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH7_AUTOCL</name>
              <description>Auto Clear</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH7</name>
          <description>USB Receive Control and Status Endpoint 7 High</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000177</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH7_DISNYET</name>
              <description>Disable NYET</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH7_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCOUNT7</name>
          <description>USB Receive Byte Count Endpoint 7</description>
          <addressOffset>0x00000178</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXCOUNT7_COUNT</name>
              <description>Receive Packet Count</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXTYPE7</name>
          <description>USB Host Transmit Configure Type Endpoint 7</description>
          <addressOffset>0x0000017A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXTYPE7_TEP</name>
              <description>Target Endpoint Number</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>USB_TXTYPE7_PROTO</name>
              <description>Protocol</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE7_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE7_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE7_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE7_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXTYPE7_SPEED</name>
              <description>Operating Speed</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE7_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE7_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE7_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXINTERVAL7</name>
          <description>USB Host Transmit Interval Endpoint 7</description>
          <addressOffset>0x0000017B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXINTERVAL7_TXPOLL</name>
              <description>TX Polling</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXINTERVAL7</name>
          <description>USB Host Transmit Interval Endpoint 7</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x0000017B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXINTERVAL7_NAKLMT</name>
              <description>NAK Limit</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXTYPE7</name>
          <description>USB Host Configure Receive Type Endpoint 7</description>
          <addressOffset>0x0000017C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXTYPE7_TEP</name>
              <description>Target Endpoint Number</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>USB_RXTYPE7_PROTO</name>
              <description>Protocol</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE7_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE7_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE7_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE7_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_RXTYPE7_SPEED</name>
              <description>Operating Speed</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE7_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE7_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE7_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXINTERVAL7</name>
          <description>USB Host Receive Polling Interval Endpoint 7</description>
          <addressOffset>0x0000017D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXINTERVAL7_TXPOLL</name>
              <description>RX Polling</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXINTERVAL7</name>
          <description>USB Host Receive Polling Interval Endpoint 7</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x0000017D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXINTERVAL7_NAKLMT</name>
              <description>NAK Limit</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT1</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 1</description>
          <addressOffset>0x00000304</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT1</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT2</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 2</description>
          <addressOffset>0x00000308</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT2</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT3</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 3</description>
          <addressOffset>0x0000030C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT3</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT4</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 4</description>
          <addressOffset>0x00000310</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT4_COUNT</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT5</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 5</description>
          <addressOffset>0x00000314</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT5_COUNT</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT6</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 6</description>
          <addressOffset>0x00000318</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT6_COUNT</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT7</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 7</description>
          <addressOffset>0x0000031C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT7_COUNT</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDPKTBUFDIS</name>
          <description>USB Receive Double Packet Buffer Disable</description>
          <addressOffset>0x00000340</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXDPKTBUFDIS_EP1</name>
              <description>EP1 RX Double-Packet Buffer Disable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP2</name>
              <description>EP2 RX Double-Packet Buffer Disable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP3</name>
              <description>EP3 RX Double-Packet Buffer Disable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP4</name>
              <description>EP4 RX Double-Packet Buffer Disable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP5</name>
              <description>EP5 RX Double-Packet Buffer Disable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP6</name>
              <description>EP6 RX Double-Packet Buffer Disable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP7</name>
              <description>EP7 RX Double-Packet Buffer Disable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDPKTBUFDIS</name>
          <description>USB Transmit Double Packet Buffer Disable</description>
          <addressOffset>0x00000342</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXDPKTBUFDIS_EP1</name>
              <description>EP1 TX Double-Packet Buffer Disable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP2</name>
              <description>EP2 TX Double-Packet Buffer Disable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP3</name>
              <description>EP3 TX Double-Packet Buffer Disable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP4</name>
              <description>EP4 TX Double-Packet Buffer Disable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP5</name>
              <description>EP5 TX Double-Packet Buffer Disable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP6</name>
              <description>EP6 TX Double-Packet Buffer Disable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP7</name>
              <description>EP7 TX Double-Packet Buffer Disable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
